# Titanic Analise

In [52]:
linkc = 'https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv'
titanic = pd.read_csv(linkc,sep="\t") # utilizando o sepeado tipo tab
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [53]:
titanic.columns=['IDPassageiro','Sobreviveu','Classe','Nome','Sexo','Idade','irmãos / cônjuges a bordo','Filhos','Ticket','tarifa','cabine','Porto de embarcação']
titanic.head()

   IDPassageiro  Sobreviveu  Classe  ...   tarifa cabine  Porto de embarcação
0             1           0       3  ...   7.2500    NaN                    S
1             2           1       1  ...  71.2833    C85                    C
2             3           1       3  ...   7.9250    NaN                    S
3             4           1       1  ...  53.1000   C123                    S
4             5           0       3  ...   8.0500    NaN                    S

[5 rows x 12 columns]

In [54]:
# Informar os tipos de dados
titanic.dtypes

IDPassageiro                   int64
Sobreviveu                     int64
Classe                         int64
Nome                          object
Sexo                          object
Idade                        float64
irmãos / cônjuges a bordo      int64
Filhos                         int64
Ticket                        object
tarifa                       float64
cabine                        object
Porto de embarcação           object
dtype: object

In [56]:
# Descreve em números a estrutura da tabela 
titanic.describe()

       IDPassageiro  Sobreviveu  ...      Filhos      tarifa
count    156.000000  156.000000  ...  156.000000  156.000000
mean      78.500000    0.346154  ...    0.397436   28.109587
std       45.177428    0.477275  ...    0.870146   39.401047
min        1.000000    0.000000  ...    0.000000    6.750000
25%       39.750000    0.000000  ...    0.000000    8.003150
50%       78.500000    0.000000  ...    0.000000   14.454200
75%      117.250000    1.000000  ...    0.000000   30.371850
max      156.000000    1.000000  ...    5.000000  263.000000

[8 rows x 7 columns]